{
  "status": {
    "elapsed": 2,
    "timestamp": "2022-05-13T04:30:58.165811286Z"
  },
  "data": {
    "id": "1e31218a-e44e-4285-820c-8282ee222035",
    "serial_id": 6057,
    "symbol": "BTC",
    "name": "Bitcoin",
    "slug": "bitcoin",
    "contract_addresses": null,
    "_internal_temp_agora_id": "9793eae6-f374-46b4-8764-c2d224429791",
    "profile": {
      "general": {
        "overview": {
          "is_verified": false,
          "tagline": "A peer-to-peer electronic cash system",
          "category": "Payments",
          "sector": "Currencies",
          "tags": "",
          "project_details": "Bitcoin is the first <a href=\"https://messari.io/resource/distributed-systems\">distributed consensus-based</a>, censorship-resistant, permissionless, peer-to-peer payment settlement network with a provably scarce, programmable, native currency. Bitcoin (BTC), the native asset of the Bitcoin blockchain, is the world's first digital currency without a central bank or administrator. The Bitcoin network is an emergent decentralized monetary institution that exists through the interplay between <a href=\"https://messari.io/resource/node\">full nodes</a>, <a href=\"https://messari.io/resource/mining\">miners</a>, and developers. It is set by a social contract that is created and opted into by the users of the network and hardened through <a href=\"https://messari.io/c/resource/game-theory\">game theory</a> and <a href=\"https://messari.io/resource/cryptography\">cryptography</a>. Bitcoin is the first, oldest, and largest cryptocurrency in the world.",
          "official_links": [
            {
              "name": "Whitepaper",
              "link": "https://bitcoin.org/bitcoin.pdf"
            },
            {
              "name": "Github",
              "link": "https://github.com/bitcoin/bitcoin"
            },
            {
              "name": "Twitter",
              "link": "https://twitter.com/bitcoin"
            },
            {
              "name": "Telegram",
              "link": "http://t.me/bitcoin"
            },
            {
              "name": "Reddit",
              "link": "https://www.reddit.com/r/Bitcoin/"
            }
          ]
        },
        "background": {
          "background_details": "\nPre-history\nBitcoin borrows from nearly three decades of research by academics, cypherpunk practitioners, and hobbyists who tried to create similar payment protocols. Some of the most prominent projects that preceded Bitcoin include: Digicash, b-money, Hashcash, e-gold, and Bit Gold. Bitcoin is often associated with Austrian economic theories, anarcho-capitalist principles, and general libertarian politicking by virtue of the exclusive developer community to whom Nakamoto first released their white paper, certain protocol design characteristics, and the political affiliations of early Bitcoin investors. \n\nConception to Launch\nOn October 31, 2008, at the peak of the Global Financial Crisis, just six weeks after the infamous investment bank, Lehman Brothers, declared bankruptcy, the pseudonymous <a href=\"https://messari.io/person/satoshi-nakamoto\">Satoshi Nakamoto</a> released the Bitcoin whitepaper to the cryptography mailing list. Titled \"Bitcoin: A Peer-to-Peer Electronic Cash System\", the whitepaper proposed a new electronic cash system that would allow fully peer-to-peer online payments without reliance on trusted third parties. Soon after the release of the whitepaper, Satoshi implemented the Bitcoin software as open-source code. On 3 January 2009, the Bitcoin network came into existence with Satoshi mining the genesis block of Bitcoin, which included a now-famous \"The Times\" headline in the <a href=\"https://messari.io/resource/coinbase-transaction\">coinbase</a> both to prove the network’s fair launch and to make a political statement about the global financial system. The event marked the birth of the world's first non-sovereign, decentralized, digital money.\n\nPost Launch\n<a href=\"https://messari.io/person/hal-finney\">Hal Finney</a>, who invented the first reusable proof-of-work system (RPoW) in 2004, received the first Bitcoin transaction (10 bitcoins) on January 12, 2009. In 2010, the first known commercial transaction using bitcoin occurred when programmer <a href=\"https://messari.io/person/laszlo-hanyecz\">Laszlo Hanyecz</a> bought two Papa John's pizzas for 10,000 bitcoins. \n\nIn August 2010, a major vulnerability in the Bitcoin protocol was spotted and exploited in the Bitcoin network, allowing users to create an infinite amount of bitcoins. The transactions exploiting the vulnerability were quickly spotted and erased for the Bitcoin blockchain, with the vulnerability being patched in a network upgrade of the Bitcoin protocol. This was the only major security flaw found and exploited in Bitcoin's history.\n\nIn December 2010, amidst rising publicity from Bitcoin's use in financing Wikileaks, Satoshi Nakamoto, disappeared from involvement with Bitcoin. It is unknown why Satoshi disappeared from the project, although some believe Satoshi, cognizant of past struggles to launch a digital currency, recognized that a leader of the Bitcoin project could be a central point of failure. It is estimated that Nakamoto had mined about one million bitcoins before disappearing in 2010 when he handed the network alert key and control of the code repository over to <a href=\"https://messari.io/person/gavin-andresen\">Gavin Andresen</a>.\n\nSilk Road & Mt. Gox\nOne of the most iconic early use cases for Bitcoin was the Silk Road. Launched in early 2011, the Silk Road was a darknet marketplace that allowed users to buy and sell a wide variety of goods including, most notably, illegal drugs. Underpinning the Silk Road was the Tor network, which allowed users to browse the Silk Road anonymously and securely without potential traffic monitoring, and Bitcoin which provided a censorship-resistant payment rail for pseudonymous transactions. Over the course of its life, it is estimated that the Silk Road facilitated more than $1.2 billion in transactions, collecting over $80 million in sales commissions, leveraging the Bitcoin network as its payment rail. The site was shut down in 2013 when the FBI took advantage of the Silk Road’s centralized infrastructure, arresting founder <a href=\"https://messari.io/person/ross-ulbricht\">Ross Ulbricht</a>, and shuttering the site.\n\nFounded by <a href=\"https://messari.io/person/jed-mccaleb\">Jed McCaleb</a> in July 2010, and led by <a href=\"https://messari.io/person/mark-karpeles\">Mark Karpeles</a> until it collapsed, <a href=\"https://messari.io/organization/mtgox\">Mt. Gox</a> was one of the earliest Bitcoin exchanges in the world. Based in Tokyo, Japan, the exchange would go on to handle over 70% of all bitcoin (BTC) transactions worldwide at its peak. Known for its chronic security issues, Mt. Gox was infamously hacked in 2014, losing 850,000 bitcoins worth about $450 million at the time. The hack sent the price of Bitcoin, which was in the midst of one of its first major price bubbles, plummeting. Bitcoin would sink into a bear market with prices not recovering until the 2017 bull run.\n\n2017 Bubble & Bitcoin Cash Hard Fork\nThe 2017 price bubble was a watershed moment for Bitcoin. The price of Bitcoin rose more than 1900% from just under $1,000 at the beginning of the year to near $20,000 at its peak in December. At its peak, Bitcoin's market capitalization eclipsed $325 billion. Along with the proliferation of Initial Coin Offerings, powered by Ethereum, Bitcoin's incredible 2017 run propelled cryptocurrency into mainstream consciousness, among the most discussed phenomena of 2017.\n\nAlso notable in 2017, Bitcoin experienced its <a href=\"https://messari.io/article/bitcoin-cash-hard-fork\">most contentious fork to date</a>. Amidst rising transaction fees on Bitcoin and increasingly divergent views on scaling Bitcoin, an agreement was reached amongst prominent Bitcoin stakeholders in what is now known as the \"New York Agreement\". The agreement was to support a set of network upgrades called SegWit2x. The proposal was backed by over 80% of Bitcoin's hash rate. However, despite the desires of miners, users wanted to activate <a href=\"https://messari.io/article/segregated-witness\">SegWit</a> without the 2MB block size increase, the philosophy underpinning this decision being that the users controlled the network, not miners and Bitcoin businesses. Subsequently, they set a date (August 1, 2017) where Bitcoin would soft fork to support SegWit and keep the 1MB block size. Enough nodes signaled support for it that they forced miners to accept or have their blocks rejected by the network. A faction of the bigger blocks camp, rejected SegWit altogether, citing frustrations with the prioritization of SegWit over bigger blocks, and on August 1, 2017, they launched a hard fork of Bitcoin called Bitcoin Cash, with 8MB block limits. These events marked, one end, a landmark demonstration of power by the users of the Bitcoin network, and on the other end, the first great schism within the Bitcoin community.\n\n2018 - 2019\nAfter peaking in December 2017, Bitcoin, along with the rest of the cryptocurrency market in January 2018, crashed, sending the cryptocurrency market into its latest bear market. Since then Bitcoin has dropped as low as $3,200, more than 80% below its ATH. However, while prices have yet to recover to 2017 highs, the institutionalization of Bitcoin has picked up significantly. Traditional Wall Street institutions including Chicago Mercantile Exchange, Intercontinental Exchange, and Fidelity have all launched cryptocurrency offerings, opening up the market to institutional investors. There are now several regulated exchanges and custodians. Furthermore, regulatory clarity around Bitcoin has improved dramatically with SEC Chairman, Jay Clayton, revealing at a Congressional hearing in February 2018, that the SEC does not consider Bitcoin to be a security.\n\nSince it reached its cycle low in February 2019, Bitcoin's price has recovered considerably, rising as high as $13,000 in June. With the recent announcements of Facebook's Libra project and China's Central Bank digital currency, governments and multinational corporations around the world have begun to look at cryptocurrencies more seriously. American officials are debating a digital dollar and lawmakers around the world are considering the central bank digital currency (CBDC) options. Furthermore, there have been numerous cryptocurrency-related hearings since Libra was announced. China has recently <a href=\"https://messari.io/article/china-blockchain-madness\">announced</a> blockchain was a revolutionary technology and that it would make blockchain technology a strategic imperative for the country. Bitcoin's price rose more than 40% after the announcement, its highest intraday movement since 2011.\n\n2020 - 2021\nBitcoin traded sideways into 2020, but the onset of the novel Coronavirus (COVID-19) Pandemic saw world markets take the biggest dips since at least the 2007-08 Mortgage Crisis. Bitcoin did not escape the dip – in less than 48 hours it lost half of its value, going below $4,000 for the first time since March of 2019. Luckily for bitcoiners, bitcoin rebounded, returning to its pre-pandemic price in less than a month.\n\nBitcoin’s ascent recovery out of the March turmoil drew wider media and institutional attention and lent credibility to its store of value narrative. Although it remained around $10,000 throughout Ethereum’s firey <a href=\"https://messari.io/article/a-data-driven-look-at-the-end-of-defi-s-summer\">DeFi summer</a>, bitcoin would start to trend upwards into the fall and by early November bitcoin hit $14,000. Whether it was unprecedented levels of money printing by the Federal Reserve, its V-shaped recovery in April, or direct stimulus payments to millions of Americans, it was clear bitcoin wasn’t done at $14,000 as it crossed $20,000 for the first time ever on December 16, 2020. Two weeks later it hit $28,000. Then, on January 8, 2021, bitcoin set a new all-time high of $41,429.38. Since hitting $41,000 bitcoin has mostly drifted in the $30,000.\n\nBitcoin’s price wasn’t the only thing rapidly accelerating in 2020. Institutional adoption skyrocketed. Led by Paul Tudor Jones of Microstrategy (  $1 billion), institutions joined the bitcoin world en masse. From insurance companies like MassMutual ($100 million) to investment firms like Ruffer ($744 million) new groups <a href=\"https://messari.io/article/the-potential-impact-of-increased-capital-allocation-to-bitcoin\">continue</a> to adopt bitcoin. And institutions aren’t alone – entrepreneurs like Elon Musk and politicians like Miami Mayor Francis Suarez have increasingly promoted bitcoin. Even athletes have joined the space, as NFL player Russell Okung partnered with Bitcoin Lightning Company <a href=\"https://messari.io/organization/zap\">Zap</a> to become the first professional sports player ever to be paid in bitcoin\n\n",
          "issuing_organizations": []
        },
        "roadmap": [
          {
            "title": "Whitepaper",
            "date": "2008-10-31T04:00:00Z",
            "type": null,
            "details": "Satoshi Nakamoto published the Bitcoin whitepaper"
          },
          {
            "title": "Genesis Block",
            "date": "2009-01-03T05:00:00Z",
            "type": null,
            "details": "Bitcoin's genesis block is mined"
          },
          {
            "title": "M-of-N Standard Transactions",
            "date": "2011-10-02T04:00:00Z",
            "type": null,
            "details": "BIP 011 implemented M-of-N-signatures required transactions as a new 'standard' transaction type. This BIP enabled secured wallets, escrow transactions, and other use cases where redeeming funds requires more than a single signature.\n"
          },
          {
            "title": "Pay to Script Hash ",
            "date": "2012-01-03T05:00:00Z",
            "type": null,
            "details": "BIP 016, building off of BIP 013, which introduced Pay to Script Hash address types, implemented a new \"standard\" transaction type for the Bitcoin scripting system and defined additional validation rules that apply only to the new transactions.\n\nThe BIP moved the responsibility for supplying the conditions to redeem a transaction from the sender of the funds to the redeemer. Furthermore, it allowed a sender to fund any arbitrary transaction, no matter how complicated, using a fixed-length 20-byte hash that is short enough to scan from a QR code or easily copied and pasted"
          },
          {
            "title": "Hierarchical Deterministic Wallets",
            "date": "2012-02-11T05:00:00Z",
            "type": null,
            "details": "BIP 032 introduced Hierarchical Deterministic Wallets (\"HD Wallets\"), wallets that can be shared partially or entirely with different systems, each with or without the ability to spend coins. HD wallets allow for numerous cryptocurrency wallets (public-private key pairs) to be generated from a single seed phrase."
          },
          {
            "title": "A Finite Supply for Bitcoin",
            "date": "2014-04-01T04:00:00Z",
            "type": null,
            "details": "BIP 042 introduced a finite supply for Bitcoin. After discovering a bug that would allow Bitcoin's money supply to grow indefinitely, forever, developers introduced a hard cap for Bitcoin."
          },
          {
            "title": "OP_CHECKLOCKTIMEVERIFY",
            "date": "2014-10-01T04:00:00Z",
            "type": null,
            "details": "BIP 065 introduced a new opcode (OP_CHECKLOCKTIMEVERIFY) for the Bitcoin scripting system that allows a transaction output to be made unspendable until some point in the future. This was a fundamental addition paving the way for payment channels."
          },
          {
            "title": "CHECKSEQUENCEVERIFY",
            "date": "2015-08-05T04:00:00Z",
            "type": null,
            "details": "BIP 112 implemented a new opcode (CHECKSEQUENCEVERIFY) for the Bitcoin scripting system that in combination with BIP 68 allows execution pathways of a script to be restricted based on the age of the output being spent.\n"
          },
          {
            "title": "SegWit (User Activated Soft Fork)",
            "date": "2017-08-01T04:00:00Z",
            "type": null,
            "details": "This plan was proposed as BIP 148, a Bitcoin Improvement Proposal, from a pseudonymous developer named a href=\"https://messari.io/person/shaolin-fry\"Shaolinfry/a. It was proposed in reaction to a plan referred to as \"Segwit2x\" which was an agreement among miners, developers, businesses, and investors to support SegWit (a soft fork) and a 2MB block size (hard fork). Users rejected this proposal and deployed a user-activated soft fork in a demonstration that users controlled the Bitcoin network.\n\nBIP 141 defined a new structure called a \"witness\" that is committed to blocks separately from the transaction Merkle tree. This structure contains data required to check transaction validity but not required to determine transaction effects. In particular, scripts and signatures are moved into this new structure.\nBIP 143 defines a new transaction digest algorithm for signature verification in version 0 witness program, in order to minimize redundant data hashing in verification and to cover the input value by the signature\nBIP 147 proposed changes to the Bitcoin transaction validity rules to fix a malleability vector in the extra stack element consumed by OPCHECKMULTISIG and OPCHECKMULTISIGVERIFY\nBIP 148 Defined soft fork flag day activation of the segregated witness deployment known as \"segwit\". Activated BIP141, BIP143, and BIP147. The date was set for August 1, 2017, when users would decide whether or not to deploy SegWit"
          }
        ],
        "regulation": {
          "regulatory_details": "On April 28, 2018, the SEC Chairman, Jay Clayton, revealed that the SEC does not consider Bitcoin (BTC) to be a security.\n  \"It's a complicated area. Because, as you said, there are different types of cryptoassets. Let me try and divide them into two areas. A pure medium of exchange, the one that's most often cited, is Bitcoin. As a replacement for currency, that has been determined by most people to not be a security.\n\n  Then there are tokens, which are used to finance projects. I've been on the record saying there are very few, there's none that I've seen, tokens that aren't securities. To the extent something is a security, we should regulate it as a security, and our securities regulations are disclosure-based, and people should follow those and provide the information that we require\"\n\nThe Securities Framework Asset Ratings of the Crypto Rating Council (CRC) attributed the score of 1 out of 5 to Bitcoin and provided the below summary:\nAbsence of a marketed token sale and corresponding marketing efforts\nDecentralized development and usage\nThe anonymity of the Project Team\n\nThe CRC is a member-owned and operated organization whose purpose is to assess if a crypto asset, or its development, issuance, and use have characteristics that make it more or less likely to implicate federal securities laws. According to the CRC framework, a score of 5 results when an asset appears to have many characteristics that are consistent with the Howey-test factors. A score of 1 results when an asset appears to have few characteristics that are consistent with the Howey-test factors.",
          "sfar_score": 1,
          "sfar_summary": "Absence of a marketed token sale and corresponding marketing efforts\n\nDecentralized development and usage\n\nAnonymity of the Project Team\n\nLearn More here: https://www.cryptoratingcouncil.com/asset-ratings"
        }
      },
      "contributors": {
        "individuals": [
          {
            "slug": "giel-van-schijndel",
            "first_name": "Giel",
            "last_name": "van Schijndel",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1557964800%26v%3Dbeta%26t%3DtKR24B5xQbPX3icnZ8koVy8w7TjazfdTcV2uOHQRBhE"
          },
          {
            "slug": "johnson-lau",
            "first_name": "Johnson",
            "last_name": "Lau",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://3.bp.blogspot.com/-RAbxU6Wlvlk/WLbcdJk_s7I/AAAAAAAAHfs/H9AFjGM1yPIA9JxZApxsWimzC5qzY7mUwCLcB/s1600/20.Johnson%2BLau%2BBitcoin%2Bdeveloper.jpg"
          },
          {
            "slug": "daniel-folkinshteyn",
            "first_name": "Daniel",
            "last_name": "Folkinshteyn",
            "title": "Bitcoin Core Developer",
            "description": null,
            "avatar_url": null
          },
          {
            "slug": "jo-o-barbosa",
            "first_name": "João",
            "last_name": "Barbosa",
            "title": "Bitcoin Core Developer",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1557964800%26v%3Dbeta%26t%3DL9kSumZexntjywUtDdXAVVaAFEq_kiIXN8scHyLvkQg"
          },
          {
            "slug": "martti-malmi",
            "first_name": "Martti",
            "last_name": "Malmi",
            "title": "Early Bitcoin Core Developer",
            "description": "Martti Malmi is a software developer with a passionate focus on world-changing technology. Malmi volunteered as a core developer of Bitcoin from 2009 to 2011 and maintains an extensive understanding of web technologies, from databases and servers to UI design.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/Fmh3pV8s_400x400.jpg"
          },
          {
            "slug": "michael-ford",
            "first_name": "Michael",
            "last_name": "Ford",
            "title": "Founder of Hectare.ag",
            "description": "Michael Ford is the founder of Hectare.ag and a Bitcoin Core contributor.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/tWuYGE9E_400x400.jpg"
          },
          {
            "slug": "bryant-bishop",
            "first_name": "Bryan",
            "last_name": "Bishop",
            "title": "Bitcoin Core Contributor",
            "description": "Bryan Bishop is a Bitcoin Core contributor formerly a senior blockchain engineer at LedgerX.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/zFJ-h6jT_400x400.jpg"
          },
          {
            "slug": "pablo-castellano",
            "first_name": "Pablo",
            "last_name": "Castellano",
            "title": "Co-founder of Bitso",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/Qopp6xM8_400x400.jpg"
          },
          {
            "slug": "chris-moore",
            "first_name": "Chris",
            "last_name": "Moore",
            "title": "Creator of Betco.in",
            "description": "Chris Moore is a software developer and and early Bitcoin core contributor. He also created Betco-in, the first-ever bitcoin poker room.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/573356%3Fs%3D460%26v%3D4"
          },
          {
            "slug": "laszlo-hanyecz",
            "first_name": "Laszlo",
            "last_name": "Hanyecz",
            "title": "Early Bitcoin Core Developer",
            "description": "Laszlo Hanyecz is a software developer and an early Bitcoin contributor who famously purchased 2 pizzas for 10,000 bitcoin on May 22, 2010. ",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/f1f5bf544bab3b1f31630150a8a0932b.jpg"
          },
          {
            "slug": "mike-hearn",
            "first_name": "Mike",
            "last_name": "Hearn",
            "title": "Lead Platform Engineer at R3",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1557964800%26v%3Dbeta%26t%3DOHYQcc7CJ3wKwr9d2sX747gZPjf-Hx0Ovlx3KwOw8gY"
          },
          {
            "slug": "patrick-strateman",
            "first_name": "Patrick",
            "last_name": "Strateman",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": null
          },
          {
            "slug": "jonas-schnelli",
            "first_name": "Jonas",
            "last_name": "Schnelli",
            "title": "Core Developer and Maintainer at Bitcoin",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/jonasSchnelli2.jpg"
          },
          {
            "slug": "cory-fields",
            "first_name": "Cory",
            "last_name": "Fields",
            "title": "Bitcoin Core Developer at the MIT Media Lab",
            "description": "Cory Fields is a Bitcoin Core developer for the Digital Currency Initiative at the MIT Media Lab.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/d54nyb0t9z6j3kljbjru.png"
          },
          {
            "slug": "eric-lombrozo",
            "first_name": "Eric",
            "last_name": "Lombrozo",
            "title": "Co-founder, CTO, and Co-CEO of Ciphrex ",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1555545600%26v%3Dbeta%26t%3D3D7znaGk3r_5LmB2AdmVcG05xcdAzp5Lq5JTmzFfBYw"
          },
          {
            "slug": "satoshi-nakamoto",
            "first_name": "Satoshi",
            "last_name": "Nakamoto",
            "title": "Bitcoin Creator",
            "description": "Satoshi Nakamoto is the name used by the pseudonymous person or persons who developed Bitcoin, authored the bitcoin white paper, and created and deployed Bitcoin's original reference implementation. As part of the implementation, Nakamoto also devised the first blockchain database. In the process, Nakamoto was the first to solve the double-spending problem for digital currency using a peer-to-peer network. Nakamoto was active in the development of bitcoin up until December 2010.",
            "avatar_url": null
          },
          {
            "slug": "wladimir-j-van-der-laan",
            "first_name": "Wladimir",
            "last_name": "J. van der Laan",
            "title": "Lead Maintainer for Bitcoin Core",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/download-1-19.jpg"
          },
          {
            "slug": "jorge-timon",
            "first_name": "Jorge",
            "last_name": "Timon",
            "title": "Founder of Freicoin, Co-founder of Blockstream",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1555545600%26v%3Dbeta%26t%3DDUHWwCzZALQPlYXVTUc4TB5h9_r_N57QfRbGxH76lDs"
          },
          {
            "slug": "gregory-maxwell",
            "first_name": "Gregory",
            "last_name": "Maxwell",
            "title": "Bitcoin Core Developer",
            "description": "Gregory Maxwell is a core developer for Bitcoin and a co-founder and former CTO of Blockstream. ",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/858454%3Fs%3D460%26v%3D4"
          },
          {
            "slug": "amir-taaki",
            "first_name": "Amir",
            "last_name": "Taaki",
            "title": "Creator of Dark Wallet, Libbitcoin, and Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/eIslHLnt_400x400.jpg"
          },
          {
            "slug": "pieter-wuille",
            "first_name": "Pieter",
            "last_name": "Wuille",
            "title": "Co-founder and Core Engineer at Blockstream",
            "description": "Pieter Wuille is an early Bitcoin core contributor and a co-founder and core tech engineer at Blockstream.",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/Iq3_6BeN_400x400.jpg"
          },
          {
            "slug": "luke-dashjr",
            "first_name": "Luke",
            "last_name": "Dashjr",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/6nljnZCf.jpg"
          },
          {
            "slug": "marco-falke",
            "first_name": "Marco",
            "last_name": "Falke",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/marco.png"
          },
          {
            "slug": "kalle-alm",
            "first_name": "Kalle",
            "last_name": "Alm",
            "title": "Software Developer and Bitcoin Core Contributor at Digital Garage",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/Photo_on_2010-01-19_at_10.21_400x400.jpg"
          },
          {
            "slug": "anthony-towns",
            "first_name": "Anthony",
            "last_name": "Towns",
            "title": "Bitcoin Core Developer at Xapo",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1555545600%26v%3Dbeta%26t%3DoNy9le-voFKxJNmgHv8BpqiC2qIItX3swICJDXO69H8"
          },
          {
            "slug": "gavin-andresen",
            "first_name": "Gavin ",
            "last_name": "Andresen\t",
            "title": "Former Lead Core Bitcoin Developer ",
            "description": "Chief Scientist Bitcoin Foundation, previously Lead Core Bitcoin Developer, TruCoin, researcher University of Massachusetts Amherst. ",
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/331997%3Fs%3D460%26v%3D4"
          },
          {
            "slug": "andrew-chow",
            "first_name": "Andrew",
            "last_name": "Chow",
            "title": "Bitcoin Core and Armory Developer",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/c7d40949d8e18c0007c2e45eb0264505_200_200.jpeg"
          },
          {
            "slug": "samuel-dobson",
            "first_name": "Samuel",
            "last_name": "Dobson",
            "title": "Independent Software Developer and Bitcoin Core Contributor",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1555545600%26v%3Dbeta%26t%3D_1hewHU8GK7PBe12DMuGe7lSVakbo142YkAx-m_lAAI"
          },
          {
            "slug": "jeff-garzik",
            "first_name": "Jeff",
            "last_name": "Garzik",
            "title": "CEO & Co-Founder at Bloq Inc.",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1542240000%26v%3Dbeta%26t%3D6uAq00HG-HoGjP5_qr6r5a_6gUJxYxguLhoHQVN9fLs"
          },
          {
            "slug": "hal-finney",
            "first_name": "Hal",
            "last_name": "Finney",
            "title": "Senior Cryptographic Engineer at PGP Corporation",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1555545600%26v%3Dbeta%26t%3DRleFab_s0uEL2Z-PUWtecsU67s4aZLoOgBSNy_5__BY"
          },
          {
            "slug": "nils-schneider",
            "first_name": "Nils",
            "last_name": "Schneider",
            "title": "CTO and Founder of Bitcoin Charts",
            "description": "Nils Schneider is an early core Bitcoin developer and a co-founder of Bitcoin Charts.",
            "avatar_url": null
          },
          {
            "slug": "andreas-schildbach",
            "first_name": "Andreas",
            "last_name": "Schildbach",
            "title": "Bitcoin Core Contributor and Wallet Developer",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/743306%3Fs%3D400%26v%3D4"
          },
          {
            "slug": "noel-maersk",
            "first_name": "Noel",
            "last_name": "Maersk",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": null
          },
          {
            "slug": "pavel-janik",
            "first_name": "Pavel",
            "last_name": "Janik",
            "title": "Bitcoin Core Contributor",
            "description": null,
            "avatar_url": null
          },
          {
            "slug": "william-swanson",
            "first_name": "William",
            "last_name": "Swanson",
            "title": "Chief Architect at Edge",
            "description": null,
            "avatar_url": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1557964800%26v%3Dbeta%26t%3D1UFNSgGyQXAj9ESmWEMWaBA7JiBGmF-Gku01HlGRDlQ"
          }
        ],
        "organizations": [
          {
            "slug": "mit-digital-currency-initiative",
            "name": "MIT Digital Currency Initiative",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/2nSCo3n6_400x400.jpg",
            "description": "DCI is an orgnization created to bring together the brightest minds at MIT and elsewhere to conduct the research necessary to support the development of digital currency and blockchain technology."
          },
          {
            "slug": "blockstream",
            "name": "Blockstream",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1558569600%26v%3Dbeta%26t%3DkDZJc4D8sayaKmrSzecg1UudBS0lPoU1GMpsymMIxvI",
            "description": "A technology company building products and serves for the foundation of bitcoin and blockchain financial infrastructure"
          },
          {
            "slug": "chaincode-labs",
            "name": "Chaincode Labs",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/mK5e01k0_400x400.jpg",
            "description": "A Bitcoin and cryptocurrency research and development group"
          },
          {
            "slug": "square-crypto",
            "name": "Square Crypto",
            "logo": "https://pbs.twimg.com/profile_images/1108475207113543680/noedXd8i_400x400.png",
            "description": "A Square venture focused on open source Bitcoin and crypto ecosystem development"
          }
        ]
      },
      "advisors": {
        "individuals": [],
        "organizations": []
      },
      "investors": {
        "individuals": [],
        "organizations": [
          {
            "slug": "winklevoss-capital-management-llc",
            "name": "Winklevoss Capital Management, LLC",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/Winklevoss_Capital_Management.jpg",
            "description": "Winklevoss Capital is a family office founded by Tyler Winklevoss and Cameron Winklevoss."
          },
          {
            "slug": "alameda-research-2",
            "name": "Alameda Research",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D2159024400%26v%3Dbeta%26t%3DwD9pW1LmauM4o_LrCOL4EgpoetUXBdRSmM02MUyWvwE",
            "description": "﻿Alameda Research was founded in October 2017. It manages over $100 million in digital assets and trades $600 million to $1.5 billion per day across thousands of products: all major coins and altcoins, as well as their derivatives. "
          },
          {
            "slug": "placeholder-vc",
            "name": "Placeholder VC",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0ar7Vv30_400x400.jpg",
            "description": "Placeholder is a venture capital partnership that invests in decentralized information networks."
          },
          {
            "slug": "delphi-digital",
            "name": "Delphi Digital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/iNTyjk96_400x400.jpg",
            "description": "Delphi Digital is an independent research and consulting boutique specializing in the digital asset market."
          },
          {
            "slug": "pantera-capital",
            "name": "Pantera Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/F-asSMPT_400x400.jpg",
            "description": "Pantera Capital is an investment firm focused exclusively on ventures, tokens, and projects related to blockchain tech, digital currency, and crypto assets."
          },
          {
            "slug": "three-arrows-capital",
            "name": "Three Arrows Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/EZPJ3XBUwAACZ0E.jpg",
            "description": "Three Arrows Capital Pte. Ltd. is a hedge fund manager established in 2012 and focused on providing superior risk-adjusted returns, founded by Su Zhu and Kyle Davies."
          },
          {
            "slug": "blockchain-capital",
            "name": "Blockchain Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/FOEMuzbl_400x400.jpg",
            "description": "The pioneer venture capital firm focused exclusively on the blockchain technology sector and crypto ecosystem"
          },
          {
            "slug": "1confirmation",
            "name": "1Confirmation",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/lO-SXqG5_400x400.jpg",
            "description": "A venture fund that seeks to fund exceptional founders who build to advance the decentralization of the web and society"
          },
          {
            "slug": "paradigm",
            "name": "Paradigm",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/gv546pvglklhdkr64jpe",
            "description": "A digital asset investment firm"
          },
          {
            "slug": "polychain-capital",
            "name": "Polychain Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/ql036ibhmizmnpnzp0rp",
            "description": "Polychain Capital manages a hedge fund focused on an actively managed portfolio of blockchain assets with the goal of helping advance the global adoption of cryptocurrencies."
          },
          {
            "slug": "galaxy-capital-partners",
            "name": "Galaxy Digital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/64BD965E-55za96xM_400x400.jpg",
            "description": "Galaxy Digital is a diversified, multi-service merchant bank dedicated to the digital assets and blockchain technology industry. Galaxy Digital’s multi-disciplinary team has extensive experience spanning investing, portfolio management, capital markets, operations, and blockchain technology. Galaxy Digital currently operates four distinct business lines, which include: Trading (arbitrage, macro, market making/OTC), Asset Management (management of external capital across passive and ecosystem funds), Principal Investing (private equity, venture, public equity, ICO investments, Pre-ICO investments, and liquid and illiquid cryptocurrencies), and Advisory (capital markets, M&A/restructuring, and technical consulting services to both start-ups and established institutions). Galaxy Digital’s CEO and Founder is Michael Novogratz."
          },
          {
            "slug": "multicoin-capital",
            "name": "Multicoin Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/H6xL2-2U_400x400.jpg",
            "description": "A thesis-driven cryptofund offering LPs venture capital economics with all the advantages of public market liquidity"
          },
          {
            "slug": "outlier-ventures",
            "name": "Outlier Ventures",
            "logo": "https://res-2.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_120,w_120,f_auto,b_white,q_auto:eco/uhd0virxsfdbp7pgkrem",
            "description": "Outlier Ventures has been backing Web 3 founders since 2014 and is the world’s leading Web 3 accelerator program on track to accelerate up to 100 startups and protocols in 2021 through both Ascent and their earlier pre-seed/seed program (Base Camp).\n\nBoth Base Camp and Ascent recruit at intervals throughout the year, looking for founders accelerating the open metaverse thesis by launching token networks. Specializing in a New Data Economy, NFTs, and DeFi they bring together a network of 1,000 of the world’s leading Web 3 founders, protocols, and VCs to mentor and invest."
          },
          {
            "slug": "jumpcapital",
            "name": "Jump Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/07A82E80-xk3DoCMu_400x400.jpeg",
            "description": "Jump Capital is an expansion stage venture firm with operating DNA at its core. We offer unparalleled institutional resources through Jump’s ecosystem, including access to a broad network, top research labs and academic institutions advancing the state of the art in healthcare, high-performance computing, data mining, and machine learning."
          },
          {
            "slug": "electric-capital-3",
            "name": "Electric Capital",
            "logo": "https://res.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_170,w_170,f_auto,b_white,q_auto:eco,dpr_1/untf2zhze4iegmfo4qfu",
            "description": null
          },
          {
            "slug": "union-square-ventures",
            "name": "Union Square Ventures",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1559174400%26v%3Dbeta%26t%3DXva3hMGwrZX_eRLqHekxMcqzCC1kbQ5qrU9W4YKupsA",
            "description": "USV is a small collegial partnership that manages over $1B across seven funds."
          },
          {
            "slug": "fabric-ventures",
            "name": "Fabric Ventures",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/R9KnN_w4_400x400.jpg",
            "description": "Investing in decentralised data networks powering the shift towards human-centric computing"
          },
          {
            "slug": "boost-vc",
            "name": "Boost VC",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1601510400%26v%3Dbeta%26t%3D1TTRpbLl8J8shBGgJqcBv4hBOVn1o2f-UCL6w626a30",
            "description": "The Boost VC Accelerator has invested $500k in Sci-Fi Founders. 250+ companies funded. Crypto, VR, space, AI, robotics, biotech, Sci-Fi."
          },
          {
            "slug": "digital-currency-group",
            "name": "Digital Currency Group",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/189005-c37d3b491ea9c6ba3481444dd6a511c5-medium_jpg.jpg%3Fbuster%3D1436828652",
            "description": "Digital Currency Group (formerly known as the Bitcoin Opportunity Fund) is an investment firm focused on early seed rounds in cryptocurrency firms focusing on building out the infrastructure for the industry. It was founded by fintech entrepreneur Barry Silbert, who also founded SecondMarket, a private market for illiquid assets such as startup stock options.  As a general rule, their investments focus on equity in companies rather than tokens, though they do purchase and hold cryptocurrencies. DCG also owns and operates CoinDesk, a well-known media company in the space, Genesis Trading, a bitcoin brokerage firm, and Grayscale Investments, a digital currency asset management firm. DCG has made over 100 investments in the space including well-known startups like Protocol Labs, Coinbase, and Ripple."
          },
          {
            "slug": "ld-capital",
            "name": "LD Capital",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/82A215BE-1_vlc6noKyt4Eg6fDOVbDbqQ.jpeg",
            "description": null
          }
        ]
      },
      "ecosystem": {
        "assets": [
          {
            "id": "1eaf063a-b8dd-4cfb-95dd-a06338565720",
            "name": "Tether"
          }
        ],
        "organizations": [
          {
            "slug": "xapo",
            "name": "Xapo",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/QDJ4n3Dh_400x400.jpg",
            "description": "Xapo is a Hong Kong-based company that provides a bitcoin wallet combined with a cold storage vault and a bitcoin-based debit card."
          },
          {
            "slug": "silk-road",
            "name": "Silk Road",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/Silk-Road-logo.jpeg",
            "description": "An online black market and the first modern darknet market, best known as a platform for selling illegal drugs"
          },
          {
            "slug": "blockfi",
            "name": "BlockFi",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/yQVQuKYG_400x400.jpg",
            "description": "BlockFi is a financial services company offering bitcoin-backed loans and interest accounts. "
          },
          {
            "slug": "lightning-labs",
            "name": "Lightning Labs",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/3fKbb6LR_400x400.jpg",
            "description": "Lightning Labs is developing Lightning, an overlay network built on top of an existing blockchain protocol."
          },
          {
            "slug": "omni",
            "name": "Omni",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/10849356%3Fs%3D400%26v%3D4",
            "description": "Omni is a platform for creating and trading custom digital assets and currencies. It is a software layer built on top of the most popular, most audited, most secure blockchain -- Bitcoin. Omni transactions are Bitcoin transactions that enable next-generation features on the Bitcoin Blockchain. Our reference implementation, Omni Core is an enhanced Bitcoin Core that provides all the features of Bitcoin as well as advanced Omni Layer features"
          },
          {
            "slug": "blockstream",
            "name": "Blockstream",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1558569600%26v%3Dbeta%26t%3DkDZJc4D8sayaKmrSzecg1UudBS0lPoU1GMpsymMIxvI",
            "description": "A technology company building products and serves for the foundation of bitcoin and blockchain financial infrastructure"
          },
          {
            "slug": "bakkt",
            "name": "Bakkt",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/ZfgzXoC1_400x400.jpg",
            "description": "A service designed to enable consumers and institutions to seamlessly buy, sell, store and spend digital assets"
          },
          {
            "slug": "rsk-labs",
            "name": "RSK Labs",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/dTgkjNmk_400x400.jpg",
            "description": "RSK is the first open-source smart contract platform powered by the Bitcoin Network that also rewards the Bitcoin miners via merge-mining, allowing them to actively participate in smart contract deveopment. "
          },
          {
            "slug": "chaincode-labs",
            "name": "Chaincode Labs",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/mK5e01k0_400x400.jpg",
            "description": "A Bitcoin and cryptocurrency research and development group"
          },
          {
            "slug": "square-crypto",
            "name": "Square Crypto",
            "logo": "https://pbs.twimg.com/profile_images/1108475207113543680/noedXd8i_400x400.png",
            "description": "A Square venture focused on open source Bitcoin and crypto ecosystem development"
          },
          {
            "slug": "openbazaar",
            "name": "OpenBazaar",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/0%3Fe%3D1559174400%26v%3Dbeta%26t%3DSuQtZeexIpoIpEwLHtgOER1JbdhDBfbQb5nIht07hB8",
            "description": "An open source, decentralized marketplace for peer-to-peer commerce using cryptocurrencies like Bitcoin"
          },
          {
            "slug": "bitmex",
            "name": "BitMEX",
            "logo": "https://messari.s3.amazonaws.com/images/agora-images/VrBD8JJz_400x400.jpg",
            "description": "BitMEX is a peer-to-peer cryptocurrency trading platform that gives retail investors access to the global cryptocurrency markets.\n"
          }
        ]
      },
      "economics": {
        "token": {
          "token_name": "Bitcoin",
          "token_type": "Native",
          "token_address": null,
          "block_explorers": [
            {
              "name": "Blockchain.com",
              "link": "https://www.blockchain.com/explorer"
            },
            {
              "name": "BTC ",
              "link": "https://btc.com"
            },
            {
              "name": "Blockcypher",
              "link": "https://live.blockcypher.com/btc/"
            },
            {
              "name": "BlockExplorer",
              "link": "https://blockexplorer.com"
            }
          ],
          "multitoken": [],
          "token_usage": "Payments",
          "token_usage_details": "BTC is used as a native currency within the Bitcoin network. BTC can be used for peer-to-peer payments and value storage within the Bitcoin network. Bitcoin is also used to pay fees for transactions. In efforts to keep Bitcoin decentralized, with its small, limited block sizes and low on-chain throughput, Bitcoin leverages off-chain payment channels for increased <a href=\"https://messari.io/resource/scaling\">scalability</a>. It is in this respect that Bitcoin acts as a payments settlement network.\n\nThroughout its life, Bitcoin has most notably served as a digital currency for online marketplaces, a settlement layer for transferring value between Bitcoin exchanges, a capital-raising mechanism for novel cryptocurrency projects, a collateral asset for lending products, and a speculative store of value."
        },
        "launch": {
          "general": {
            "launch_style": "Fair Launch",
            "launch_details": "Satoshi Nakamoto created the first bitcoins on January 3, 2009, by mining the genesis block. The genesis block mining reward (50 BTC) is unspendable due to the original client's block database and transaction database configuration. The coinbase of the first block included the following text:\n  \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks\"\n\nThis text has been interpreted both as a proof that the block was created on January 3, 2009, as well as a comment on fractional-reserve banking. <a href=\"https://messari.io/person/hal-finney\">Hal Finney</a> received the first bitcoin transaction on January 12, 2009. Finney had downloaded the bitcoin software when it was first released and was known the be the creator of RPoW, the first reusable proof-of-work system, in 2004."
          },
          "fundraising": {
            "sales_rounds": [],
            "sales_documents": [],
            "sales_treasury_accounts": [],
            "treasury_policies": null,
            "projected_use_of_sales_proceeds": []
          },
          "initial_distribution": {
            "initial_supply": 0,
            "initial_supply_repartition": {
              "allocated_to_investors_percentage": 0,
              "allocated_to_organization_or_founders_percentage": 0,
              "allocated_to_premined_rewards_or_airdrops_percentage": 0
            },
            "token_distribution_date": null,
            "genesis_block_date": "2009-01-03T09:00:00Z"
          }
        },
        "consensus_and_emission": {
          "supply": {
            "supply_curve_details": "Bitcoin Halving Schedule\nThe rate at which new bitcoins are created is algorithmically cut in half roughly every 4 years (210,000 blocks). Bitcoin has gone through three halvings to date; November 2012, July 2016 and most recently in May 2020. Since blocks are generated every 10 minutes on average and starting at 50 new bitcoins per block when the system was launched in 2009, this creates a very well-defined supply curve. \n\nThe stability of Bitcoin's monetary policy\nBitcoin's monetary policy is disinflationary. The annual rate of inflation decreases through time. The current supply cap of Bitcoin is set at 21 million coins. The stability of Bitcoin's monetary policy provided by this well-defined supply cap and halving schedule is a key differentiator versus other crypto assets. \n\nLearn More:\nA Model for Bitcoin's Security and the Declining Block Subsidy",
            "general_emission_type": "Inflationary",
            "precise_emission_type": "Decreasing Issuance",
            "is_capped_supply": true,
            "max_supply": 20999999.9769
          },
          "consensus": {
            "consensus_details": "Consensus\nBitcoin pioneered and currently uses <a href=\"https://messari.io/article/nakamoto-consensus\">Nakamoto Consensus</a> whereby the valid chain is the longest chain with the most accumulated <a href=\"https://messari.io/resource/proof-of-work\">proof-of-work</a>. Consensus in Bitcoin, and other systems using Nakamoto Conensus, is probabilistic because there is always a chance that a new, longer competing chain could emerge with more accumulated proof-of-work, that would invalidate the current chain.\n\nLearn More:\nHow Does Distributed Consensus Work Anyways?\n<a href=\"https://messari.io/article/nakamoto-consensus\">Nakamoto Consensus</a>\n\nMining\nMiners solve computational puzzles to generate new blocks using a <a href=\"https://messari.io/resource/sha-256\">SHA-256</a> algorithm. In this process, miners compete to generate a <a href=\"https://messari.io/blog/hash-function\">hash</a> less than the target number set by Bitcoin's <a href=\"https://messari.io/resource/difficulty-level\">difficulty adjustment algorithm</a>. The target difficulty level is adjusted every 2016 blocks.\n\nAlthough open to anyone with a CPU, Bitcoin mining is now dominated by <a href=\"https://messari.io/resource/application-specific-integrated-circuits-asics\">ASICs</a> situated in enterprise-scale data centers. In order to smooth individual miner revenue as mining has become more competitive, mining is now done in pools where participants contribute <a href=\"https://messari.io/resource/hash-power\">hash power</a> to the pool and receive a proportional share of the profits if the pool finds a valid block.\n\nLearn More:\n<a href=\"https://messari.io/resource/mining\">Cryptocurrency Mining</a>\nState of Cryptocurrency Mining",
            "general_consensus_mechanism": "Proof-of-Work",
            "precise_consensus_mechanism": "Nakamoto Consensus",
            "targeted_block_time": 600,
            "block_reward": 6.25,
            "mining_algorithm": "SHA-256",
            "next_halving_date": "2024-05-10T04:00:00Z",
            "is_victim_of_51_percent_attack": false
          }
        },
        "native_treasury": {
          "accounts": [],
          "treasury_usage_details": null
        }
      },
      "technology": {
        "overview": {
          "technology_details": "\"Bitcoin\" is a label used for a protocol and a currency.\n\nBitcoin, the currency, is bits of data usable outside the limitations of the protocol using second-layer solutions like <a href=\"https://messari.io/resource/lightning-network\">Lightning Network</a> payment channels. \n\nBitcoin, the protocol, is a distributed, time-stamped ledger of <a href=\"https://messari.io/resource/utxo\">unspent transaction output</a> (UTXO) transfers stored in an append-only chain of 1MB data blocks. A network of mining and economic <a href=\"https://messari.io/resource/node\">nodes</a> maintains this ledger by validating, propagating, and fighting to include <a href=\"https://messari.io/resource/mempool\">mempool</a> transactions in new blocks. Economic nodes (aka \"full nodes\") receive transactions from other network participants, validate them against network consensus rules and double-spend vectors, and propagate the transactions to other full nodes that also validate and propagate. Valid transactions are sent to the network's mempool waiting for mining nodes to confirm them via inclusion in the next block.\n\nMining nodes work to empty the mempool usually in a highest-to-lowest fee order by picking transactions to include in the next block and racing against each other to generate a hash less than the target number set by Bitcoin's difficulty adjustment algorithm. Bitcoin uses a Proof-of-Work (PoW) consensus mechanism to establish the chain of blocks with the most accumulated “work” (a.k.a., energy spent on solved hashes) as the valid chain. Other network peers can cheaply verify the chain’s work.\n\nMining difficulty regularly adjusts to maintain Bitcoin's average ten-minute block schedule. Mining nodes add new blocks to whatever chain has the largest accumulated proof of work maintained by a network of economic nodes with downloaded copies of the same chain.\n\nLearn More:\nBitcoin Developer's Guide\nMastering Bitcoin",
          "client_repositories": [
            {
              "name": "Bitcoin Core Repository",
              "link": "https://github.com/bitcoin/bitcoin",
              "license_type": "MIT License"
            }
          ]
        },
        "security": {
          "audits": [],
          "known_exploits_and_vulnerabilities": [
            {
              "title": "Value Overflow Incident",
              "date": "2010-08-06T04:00:00Z",
              "type": "Inflation",
              "details": "On 6 August 2010, a major vulnerability in the bitcoin protocol was spotted. Transactions weren't properly verified before they were included in the transaction log or blockchain, which let users bypass bitcoin's economic restrictions and create an indefinite number of bitcoins. On 15 August, the vulnerability was exploited; over 184 billion bitcoins were generated in a transaction and sent to two addresses on the network. Within hours, the transaction was spotted and erased from the transaction log after the bug was fixed and the network forked to an updated version of the bitcoin protocol. This was the only major security flaw found and exploited in bitcoin's history."
            },
            {
              "title": "Denial of Service Vulnerability",
              "date": "2018-09-20T04:00:00Z",
              "type": "Inflation",
              "details": "On September 17, Bitcoin Core developers discovered that older versions of Bitcoin Core will crash if they try to process a block containing a transaction that attempts to spend the same input twice. Such blocks are invalid, so they can only be created by a miner willing to sacrifice their allowed income for creating a block of at least 12.5 BTC (about $80,000 USD as of this writing). \n\nSoon after discovering the DDoS attack vulnerability, Bitcoin Core developers also discovered an inflation bug which they quickly determined had the same root cause and fix. They decided to disclose the DDoS vulnerability immediately while keeping the inflation bug quiet. This provided developers time to reach out to miners, businesses, and other affected systems about upgrading their software, while also providing additional time to fix the exploit.\n\nhttps://bitcoincore.org/en/2018/09/18/release-0.16.3/\nhttps://bitcoincore.org/en/2018/09/20/notice/"
            }
          ]
        }
      },
      "governance": {
        "governance_details": "Model Overview\nBitcoin governance is the process by which protocol rules are decided upon, implemented, and enforced. Users (full nodes) adopt new rules according to their subjective views on what Bitcoin is and should be. If two or more individuals adopt the same set of rules, they form an inter-subjective social consensus of what “Bitcoin” is. It is in this respect that many conceptualize Bitcoin as being set by a social contract. Every time rule changes are contemplated, the rules of the contract are decided and renegotiated continuously between stakeholders. Protocol changes are legitimized when users agree to adopt the new changes. Once adopted, the Bitcoin protocol automates the enforcement of the social contract.\n\nProcess Overview\nProtocol development is governed by a proposal process whereby anyone in the open-source Bitcoin community can submit <a href=\"https://messari.io/resource/bitcoin-improvement-proposal-bip\">Bitcoin Improvement Proposals</a> (\"BIPs\"). After debate by the community, when consensus has emerged, the Bitcoin Core maintainers merge code changes into Bitcoin Core's GitHub Repository. Once new code has been implemented into the Bitcoin Core client, users of the network (full nodes) must be persuaded to adopt the new changes. Protocol changes are “ratified” on-chain when the majority of the network adopts the upgrade and doesn’t break consensus.\n\nOnce rules are adopted on-chain, all new transactions and block proposals are subject to the agreed-upon rules. Full nodes only accept new transactions and block proposals that are valid according to the rules of the Bitcoin protocol. Anything that is not valid will be rejected. Thus, miners must implement the prevailing rules of the network in order to participate in the block creation process. \n\nUser Activated Hard Fork\n2017's <a href=\"https://messari.io/article/bitcoin-cash-hard-fork\">User Activated Soft Fork Event</a> provided an illustrative case study on Bitcoin governance in practice. \n\nAs early as 2010, shortly after Satoshi implemented a block limit into Bitcoin, discussions around block size began. These discussions largely stayed in the background until 2017 when tensions within the Bitcoin community rose over rising transaction fees and increasingly divergent opinions on scaling Bitcoin. In May 2017, a meeting between miners, businesses, investors, and core developers took place at the Consensus conference in New York, in what is now referred to as the \"New York Agreement\". The product of this meeting was an agreement to support <a href=\"https://messari.io/resource/segregated-witness\">SegWit</a> (a soft fork) and a 2MB block size (hard fork). \n\nKnown as SegWit2x, this proposal was backed by over 80% of the network’s hash rate. However, despite the desires of miners, users wanted to activate SegWit without the block size increase. This plan was proposed as BIP 148, a Bitcoin Improvement Proposal, from a pseudonymous developer named <a href=\"https://messari.io/person/shaolin-fry\">Shaolinfry</a>. Soon after, users set a date (August 1, 2017) where Bitcoin would soft fork to support SegWit and keep the 1MB block size. Eventually, enough nodes signaled support for it, forcing miners to accept or have their blocks rejected by the network. \n\nMany see this user-activated soft fork (UASF) as a pivotal moment in Bitcoin’s history. The philosophy underpinning the event was that users controlled the network, not miners. The event not only illustrated the balance of power within Bitcoin's network, but also calmed suspicions that parties such as miners, businesses, or Bitcoin Core developers, controlled Bitcoin. \n\nLearn More: \nBitcoin Governance\nUnpacking Bitcoin's Social Contract\nWho Controls Bitcoin Core?\nBitcoin Miners Beware: Invalid Blocks Need Not Apply",
        "onchain_governance": {
          "onchain_governance_type": null,
          "onchain_governance_details": null,
          "is_treasury_decentralized": false
        },
        "grants": []
      },
      "metadata": {
        "updated_at": "2021-05-29T18:26:21Z"
      }
    }
  }
}
